<a href="https://colab.research.google.com/github/min02yam/R-study/blob/main/220711_%EB%AC%B8%EC%9E%90%EC%97%B4(1).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

2022.07.11
1. 문자열 찾기: grepl
2. 문자열 바꾸기: base, stringr, data.table

In [4]:
library(dplyr)

Attaching package: ‘dplyr’


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

In [92]:
#emp=read.csv("employees.csv", stringsAsFactors = TRUE)
dep=read.csv("departments.csv", stringsAsFactors = TRUE)

In [41]:
head(emp)

  EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID
1 198         Donald     OConnell  DOCONNEL 650.507.9833 21-JUN-07 SH_CLERK
2 199         Douglas    Grant     DGRANT   650.507.9844 13-JAN-08 SH_CLERK
3 200         Jennifer   Whalen    JWHALEN  515.123.4444 17-SEP-03 AD_ASST
4 201         Michael    Hartstein MHARTSTE 515.123.5555 17-FEB-04 MK_MAN
5 202         Pat        Fay       PFAY     603.123.6666 17-AUG-05 MK_REP
6 203         Susan      Mavris    SMAVRIS  515.123.7777 07-JUN-02 HR_REP
  SALARY COMMISSION_PCT MANAGER_ID DEPARTMENT_ID
1  2600   -             124        50
2  2600   -             124        50
3  4400   -             101        10
4 13000   -             100        20
5  6000   -             201        20
6  6500   -             101        40

# 1. 찾기

In [115]:
as.data.frame(installed.packages())  %>%
  filter( grepl("^y", Package) ) %>% head

     Package LibPath                 Version Priority Depends Imports LinkingTo
yaml yaml    /usr/lib/R/site-library 2.3.5   NA       NA      NA      NA
     Suggests Enhances License                     License_is_FOSS
yaml RUnit    NA       BSD_3_clause + file LICENSE NA
     License_restricts_use OS_type MD5sum NeedsCompilation Built
yaml NA                    NA      NA     yes              4.1.2

In [89]:
dep $ DEPARTMENT_NAME	 %>% table

.
          Accounting       Administration             Benefits
                   1                    1                    1
        Construction          Contracting   Control And Credit
                   1                    1                    1
       Corporate Tax            Executive              Finance
                   1                    1                    1
    Government Sales      Human Resources                   IT
                   1                    1                    1
         IT Helpdesk           IT Support        Manufacturing
                   1                    1                    1
           Marketing                  NOC           Operations
                   1                    1                    1
             Payroll     Public Relations           Purchasing
                   1                    1                    1
          Recruiting         Retail Sales                Sales
                   1                    1                    1
Shareholder Services             Shipping             Treasury
                   1                    1                    1

# 2. 바꾸기

# Base

In [61]:
dep['DEPARTMENT_NAME']= gsub("Benefits", "B", dep$DEPARTMENT_NAME, fixed=TRUE)

In [65]:
dep %>% head

  DEPARTMENT_ID DEPARTMENT_NAME MANAGER_ID LOCATION_ID
1 10            Administration  200        1700
2 20            Marketing       201        1800
3 30            Purchasing      114        1700
4 40            Human Resources 203        2400
5 50            Shipping        121        1500
6 60            IT              103        1400

# stringr

In [72]:
require(stringr)

In [74]:
dep %>% mutate(DEPARTMENT_NAME =  str_replace_all(DEPARTMENT_NAME, "Finance" , "F" )) %>% head

  DEPARTMENT_ID DEPARTMENT_NAME MANAGER_ID LOCATION_ID
1 10            Administration  200        1700
2 20            Marketing       201        1800
3 30            Purchasing      114        1700
4 40            Human Resources 203        2400
5 50            Shipping        121        1500
6 60            IT              103        1400

# data.table

In [116]:
require(data.table)

Loading required package: data.table


Attaching package: ‘data.table’


The following objects are masked from ‘package:dplyr’:

    between, first, last

In [118]:
#DT <- data.table(dep)
DT

   DEPARTMENT_ID DEPARTMENT_NAME      MANAGER_ID LOCATION_ID
1   10           Administration       200        1700
2   20           Marketing            201        1800
3   30           Purchasing           114        1700
4   40           Human Resources      203        2400
5   50           Shipping             121        1500
6   60           IT                   103        1400
7   70           Public Relations     204        2700
8   80           Sales                145        2500
9   90           Executive            100        1700
10 100           Finance              108        1700
11 110           Accounting           205        1700
12 120           Treasury              -         1700
13 130           Corporate Tax         -         1700
14 140           Control And Credit    -         1700
15 150           Shareholder Services  -         1700
16 160           Benefits              -         1700
17 170           Manufacturing         -         1700
18 180           Construction          -         1700
19 190           Contracting           -         1700
20 200           Operations            -         1700
21 210           IT Support            -         1700
22 220           NOC                   -         1700
23 230           IT Helpdesk           -         1700
24 240           Government Sales      -         1700
25 250           Retail Sales          -         1700
26 260           Recruiting            -         1700
27 270           Payroll               -         1700

In [119]:
DT[1:7,]

  DEPARTMENT_ID DEPARTMENT_NAME  MANAGER_ID LOCATION_ID
1 10            Administration   200        1700
2 20            Marketing        201        1800
3 30            Purchasing       114        1700
4 40            Human Resources  203        2400
5 50            Shipping         121        1500
6 60            IT               103        1400
7 70            Public Relations 204        2700

In [126]:
ㄴ

  DEPARTMENT_ID DEPARTMENT_NAME MANAGER_ID LOCATION_ID DEPARTMENT_NAME_STR
1 10            Administration  200        1700        Administration
2 20            Marketing       201        1800        Marketing
3 30            Purchasing      114        1700        Purchasing
4 40            Human Resources 203        2400        Human Resources
5 50            Shipping        121        1500        Shipping
6 60            NEW             103        1400        NEW

# 3.

In [127]:
?strsplit

ref. https://statwith.tistory.com/2229